<?php

namespace Database\Seeders;

use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Book;
use App\Models\Category;
use App\Models\category_book;

class booksSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    protected $categories = [
        [1 , 'จิตวิทยา'],
        [2 , 'การพัฒนาตัวเอง'],
        [3 , 'นิยาย'],
        [4 , 'ไลท์โนเวล']
    ];
    
    protected $books = [
        [1 , 'จิตวิทยาสายดาร์ก','https://storage.naiin.com/system/application/bookstore/resource/product/202304/577274/1000260516_front_XL.jpg?t=best&imgname=%E0%B8%88%E0%B8%B4%E0%B8%95%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%AA%E0%B8%B2%E0%B8%A2%E0%B8%94%E0%B8%B2%E0%B8%A3%E0%B9%8C%E0%B8%81', 213 , ' Dr. Hiro  เคยเป็นนักขายที่ล้มเหลว  ขายอะไรก็ไม่มีใครซื้อแต่แล้ววันหนึ่งขณะกำลังดูข่าว  เขาก็นึกขึ้นได้ว่า“ในโลกเรามีลัทธิที่ขายของไม่น่าเชื่อถือได้ในราคาแพงลิ่วแถมยังทำให้สาวกยอมทุ่มบริจาคทรัพย์สินจนหมดตัวแล้วทำไมผมถึงขายไม่ออกล่ะ?”เขาจึงเริ่มศึกษาเทคนิคเหล่านั้นอย่างจริงจังอ่านหนังสือทุกเล่มเกี่ยวกับการล้างสมองที่มีในท้องตลาดแล้วเอาไปปรับใช้จนกลายเป็นนักขายระดับท็อปของญี่ปุ่นนั่นคือที่มาของ  “จิตวิทยาสายดาร์ก”พบกับเทคนิคทางจิตวิทยาที่ช่วยให้คุณใช้คำพูดควบคุมจิตใจคนทำให้พวกเขาคล้อยตามและทำอย่างที่คุณต้องการโดยไม่รู้ตัว',[1,2]],
        [2 ,'ช่างมันเถอะอีกไม่กี่ปีเราก็เป็นเถ้าธุลีกันหมดแล้ว' , 'https://storage.naiin.com/system/application/bookstore/resource/product/202402/604010/1000269382_front_XXL.jpg?imgname=%E0%B8%8A%E0%B9%88%E0%B8%B2%E0%B8%87%E0%B8%A1%E0%B8%B1%E0%B8%99%E0%B9%80%E0%B8%96%E0%B8%AD%E0%B8%B0%E0%B8%AD%E0%B8%B5%E0%B8%81%E0%B9%84%E0%B8%A1%E0%B9%88%E0%B8%81%E0%B8%B5%E0%B9%88%E0%B8%9B%E0%B8%B5%E0%B9%80%E0%B8%A3%E0%B8%B2%E0%B8%81%E0%B9%87%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B9%80%E0%B8%96%E0%B9%89%E0%B8%B2%E0%B8%98%E0%B8%B8%E0%B8%A5%E0%B8%B5%E0%B8%81%E0%B8%B1%E0%B8%99%E0%B8%AB%E0%B8%A1%E0%B8%94%E0%B9%81%E0%B8%A5%E0%B9%89%E0%B8%A7' , 200 , 'หนังสือเล่มนี้เขียนมาเพื่อคนที่เป็นเดอะแบกมาทั้งชีวิต  คนที่พยายามเพื่อคนอื่นมากเกินไปจนลืมสนใจความรู้สึกของตัวเอง  คนที่เป็น People Pleaser ข้างนอกสดใส ข้างในแตกสลายไม่ใช่เรื่องผิดที่จะใจดีกับตัวเองบ้าง หากการทำเพื่อคนอื่นทำให้รู้ว่าทุกวันนี้คุณอยู่เพื่อใคร ทำเพื่อใคร และเพราะอะไร  การปล่อยมือจากภาระที่แบกไว้ชั่วคราวแล้วใช้เวลาอยู่กับตัวเอง โอบกอดตัวเอง และชื่นชมตัวเองก็สำคัญไม่แพ้กัปลดปล่อยตัวเองด้วยการคิดแบบนี้บ้างก็ได้ว่า “ฉันไม่ได้ละเลยหน้าที่ แต่แค่กำลังชาร์จพลัง” ชีวิตจะไร้ความหมาย ถ้ามัวแต่ทำงานของวันพรุ่งนี้ในวันนี้  ส่วนใหญ่เรื่องที่กังวลมักไม่เกิดขึ้นจริง เพราะคุณไม่ใช่ผู้วิเศษที่หยั่งรู้อนาคตสักหน่อยถ้ารักตัวเองเป็น ชีวิตจะเข้าสู่โหมดง่าย ยังงั้นมาใช้ชีวิตในโหมดง่ายกันดีกว่าถึงจะไม่สมบูรณ์แบบ ไม่ได้เป็นคนสำคัญ แต่ก็ไม่เห็นเป็นไรเลยเพราะนี่คือกระบวนการที่จำเป็นในการฟื้นตัวและใช้ชีวิตที่มีเพียงแค่ครั้งเดียวนี้อย่างมีความสุข',[1,2]],
        [3 , 'ใช้คลื่นพลังบวกดึงดูดพลังสุข' , 'https://storage.naiin.com/system/application/bookstore/resource/product/202109/533411/1000243428_front_XXL.jpg?imgname=%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B8%84%E0%B8%A5%E0%B8%B7%E0%B9%88%E0%B8%99%E0%B8%9E%E0%B8%A5%E0%B8%B1%E0%B8%87%E0%B8%9A%E0%B8%A7%E0%B8%81%E0%B8%94%E0%B8%B6%E0%B8%87%E0%B8%94%E0%B8%B9%E0%B8%94%E0%B8%9E%E0%B8%A5%E0%B8%B1%E0%B8%87%E0%B8%AA%E0%B8%B8%E0%B8%82' , 208 , ' ความลับของการบรรลุในสิ่งยิ่งใหญ่คือการเข้าใจ กฎแห่งแรงสั่นสะเทือนที่กล่าวว่าทุกอย่างในจักรวาลล้วนเกิดจากแรงสั่นสะเทือนทุกแรงสั่นสะเทือนที่มีความถี่ตรงกันสามารถดึงดูดกันได้ อย่าเผลอไผลไปตามสมองที่ติดนิสัยชอบผลักไสโชคและสิ่งดีๆด้วยพลังลบยิ่งคุณส่งคลื่นพลังบวกออกสู่ภายนอก จักรวาลจะยิ่งสะท้อนคลื่นความสุขกลับมาเท่าทวีคูณ ทุกคำพูด อารมณ์ และการกระทำของคุณเปลี่ยนชีวิตคุณได้ทันที เว็กซ์ คิงส์ ผู้ได้รับการยกย่องว่าเป็นผู้นำทางจิตวิญญาณแก่คนรุ่นใหม่จะเปลี่ยนคลื่ความถี่ทางอารมณ์ของคุณให้ตรงกับพลังงานบวกทั้งหลาย เพื่อดึงดูดความสุขและความสำเร็จอย่างที่คุณอาจไม่เคยคิดฝัน เราจะเรียนรู้วิธีรักตัวเองอย่างแท้จริงได้อย่างไร จะเปลี่ยนอารมณ์ลบไปเป็นด้านบวกได้อย่างไร แล้วการมองหาความสุขที่ยั่งยืนนั้นเป็นไปได้จริงไหม เว็กซ์ คิง อินฟลูเอนเซอร์ จะตอบคำถามเกี่ยวกับการใช้ชีวิตที่ค้นส่วนใหญ่สงสัย นำเสนอในภาษาที่อ่านง่าย ย่อยเป็นหัวข้อสั้นๆ มีภาพประกอบและแทรก Quote เป็นแรงบันดาลใจ',[1,2]],
        [4 , 'จิตวิทยาอ่านใจคนขั้นสุด MINDREADER' , 'https://storage.naiin.com/system/application/bookstore/resource/product/202310/592735/1000265770_front_XXL.jpg?imgname=%E0%B8%88%E0%B8%B4%E0%B8%95%E0%B8%A7%E0%B8%B4%E0%B8%97%E0%B8%A2%E0%B8%B2%E0%B8%AD%E0%B9%88%E0%B8%B2%E0%B8%99%E0%B9%83%E0%B8%88%E0%B8%84%E0%B8%99%E0%B8%82%E0%B8%B1%E0%B9%89%E0%B8%99%E0%B8%AA%E0%B8%B8%E0%B8%94-MINDREADER' , 230 , '“ถ้าอ่านใจคนออก...รบร้อยครั้งก็ชนะร้อยครั้ง!”MINDREADER จิตวิทยาอ่านใจคนขั้นสุดจะแนะนำกลวิธีอ่านใจคนขั้นสูงที่ใช้กันอย่างแพร่หลายในกองทัพและหน่วยงานด้านความมั่นคงของสหรัฐอเมริกาซึ่งจะช่วยให้คุณสามารถเจาะลึกเข้าถึง “จิตใต้สำนึก” ของผู้คนและล่วงรู้สิ่งที่พวกเขากำลังคิดและรู้สึกจริง ๆแม้ว่าพวกเขาจะไม่ได้เอ่ยปากพูดอะไรกับคุณเลยก็ตาม ผลงานเล่มล่าสุดจาก David J. Liebermanผู้เชี่ยวชาญระดับโลกด้านพฤติกรรมมนุษย์และที่ปรึกษาด้านการสืบหาความจริงของ FBI',[1,2]],
        [5 , 'เลิกเป็นคนดี แล้วจะมีความสุข' , 'https://storage.naiin.com/system/application/bookstore/resource/product/201810/242979/1000211942_front_XXL.jpg?imgname=%E0%B9%80%E0%B8%A5%E0%B8%B4%E0%B8%81%E0%B9%80%E0%B8%9B%E0%B9%87%E0%B8%99%E0%B8%84%E0%B8%99%E0%B8%94%E0%B8%B5-%E0%B9%81%E0%B8%A5%E0%B9%89%E0%B8%A7%E0%B8%88%E0%B8%B0%E0%B8%A1%E0%B8%B5%E0%B8%84%E0%B8%A7%E0%B8%B2%E0%B8%A1%E0%B8%AA%E0%B8%B8%E0%B8%82' , 191 , 'ทุกคนต้องการเป็นที่ชื่นชอบและได้รับการยอมรับกันทั้งนั้น แต่บางคนก็แคร์สายตาคนอื่นมากไปจนไม่เป็นตัวของตัวเอง สุดท้ายก็กดดันและเป็นทุกข์ "เลิกเป็นคนดี แล้วจะมีความสุข" จะช่วยให้คุณกล้าเป็นตัวเองมากขึ้น และแคร์สายตาคนอื่นน้อยลง เช่น เลิกกลัวการถูกเกลียด เลิกเปลี่ยนตัวเองให้เข้ากับคนอื่น และเลิกเกรงใจจนเกินเหตุ เป็นต้น เลิกฝันทำสิ่งที่ไม่ชอบเพราะอยากให้คนอื่นพอใจหันมาทำสิ่งที่ต้องการแล้วชีวิตจะง่ายขึ้น',[1,2]],
        [6 , 'สืบคดีปริศนาหมอยาตำรับโคมแดง เล่ม 1 (LN)' , 'https://storage.naiin.com/system/application/bookstore/resource/product/202008/509988/1000234493_front_XXL.jpg?imgname=%E0%B8%AA%E0%B8%B7%E0%B8%9A%E0%B8%84%E0%B8%94%E0%B8%B5%E0%B8%9B%E0%B8%A3%E0%B8%B4%E0%B8%A8%E0%B8%99%E0%B8%B2%E0%B8%AB%E0%B8%A1%E0%B8%AD%E0%B8%A2%E0%B8%B2%E0%B8%95%E0%B8%B3%E0%B8%A3%E0%B8%B1%E0%B8%9A%E0%B9%82%E0%B8%84%E0%B8%A1%E0%B9%81%E0%B8%94%E0%B8%87-%E0%B9%80%E0%B8%A5%E0%B9%88%E0%B8%A1-1-(LN)' , 251 , 'ณ อาณาจักรใหญ่ยักษ์แห่งหนึ่งซึ่งตั้งอยู่ใจกลางทวีป เด็กสาวนางหนึ่งผู้ทำงานเป็น "หมอยา" ในสถานเริงรมย์ย่านโคมแดงอันมีนามว่า ‘เมาเมา’ บัดนี้เกิดจับพลัดจับผลูต้องมาทำงานรับใช้อยู่ในวังหลังเธอทำได้เพียงเฝ้ารอให้หมดวาระการทำงานอย่างสงบเสงี่ยมเจียมตัว ด้วยรูปร่างหน้าตาที่ไม่สะสวยจึงมั่นใจเป็นนักหนาว่าตนจะไม่มีวันโดนจักรพรรดิเรียกไปเป็น ‘คู่นอน’ อย่างแน่แท้ แต่ในขณะนั้นเอง โอรสธิดาของจักรพรรดิกลับมีเหตุให้อายุสั้น พอรู้ว่าสองทารกน้อยที่ยังเหลือรอดกำลังป่วยหนัก เมาเมาจึงลงมือขุดคุ้ยหาสาเหตุ นิยายสืบสวนสอบสวนที่สุดแห่งความตื่นเต้นเร้าใจของสาวน้อย "ผู้ชิมสำรับ" ราชสำนักยุคกลางของมหาอาณาจักรแห่งซีกโลกตะวันออกยังมีคดีปริศนาสุดโหดหินให้หมอยาผู้นี้ต้องคลี่คลายไม่ได้หยุดหย่อน!' ,[3,4]]
    ];
    public function run(): void
    {
        foreach($this->categories as $item){
            if(!Category::where('name',$item[1])->first()){
                Category::create([
                    'name' => $item[1]
                ]);
            };
        };
        foreach($this->books as $item){
          if(!Book::where('name',$item[1])->first()){
            Book::create([
                'name' => $item[1],
                'image' => $item[2],
                'description' => $item[4],
                'price' => $item[3]
            ]);
            foreach($item[5] as $i){
                category_book::create([
                    'book_id' => $item[0],
                    'category_id' => $i
                ]);
            };
          };
        };

    }
}
